# all principal parts from Mastronarde's master list

from greek_accentuation.characters import *
import re

character_map = {
    'a': 'α',
    'b': 'β',
    'g': 'γ',
    'd': 'δ',
    'e': 'ε',
    'z': 'ζ',
    'h': 'η',
    'q': 'θ',
    'i': 'ι',
    'k': 'κ',
    'l': 'λ',
    'm': 'μ',
    'n': 'ν',
    'c': 'ξ',
    'o': 'ο',
    'p': 'π',
    'r': 'ρ',
    's': 'σ',
    't': 'τ',
    'u': 'υ',
    'f': 'φ',
    'x': 'χ',
    'y': 'ψ',
    'w': 'ω',
}

# master verb list
verbs = [
    ['ἀγγέλλω', 'ἀγγελέω', 'ἤγγειλα', 'ἤγγελκα', 'ἤγγελμαι', 'ἠγγέλθην'],
    ['ἀγνοέω', 'ἀγνοήσω', 'ἠγνόησα', 'ἠγνόηκα', 'ἠγνόημαι', 'ἠγνοήθην'],
    ['ἄγω', 'ἄξω', 'ἤγαγον', 'ἦχα', 'ἦγμαι', 'ἤχθην'],
    ['ἀδικέω', 'ἀδικήσω', 'ἠδίκησα', 'ἠδίκηκα', 'ἠδίκημαι', 'ἠδικήθην'],
    ['ἁθροίζω', 'ἁθροίσω', 'ἥθροισα', 'ἥθροικα', 'ἥθροισμαι', 'ἡθροίσθην'],
    ['αἱρέω', 'αἱρήσω', 'εἷλον (ἑλ-)', 'ᾕρηκα', 'ᾕρημαι', 'ᾑρέθην'],
    ['αἰσθάνομαι', 'αἰσθήσομαι', 'ᾐσθόμην', '', 'ᾔσθημαι', ''],
    ['αἰτέω', 'αἰτήσω', 'ᾔτησα', 'ᾔτηκα', 'ᾔτημαι', 'ᾐτήθην'],
    ['αἰτιάομαι', 'αἰτιάσομαι', 'ᾐτιασάμην', '', 'ᾐτίαμαι', 'ᾐτιάθην'],
    ['ἀκούω', 'ἀκούσομαι', 'ἤκουσα', 'ἀκήκοα', '', 'ἠκούσθην'],
    ['ἁλίσκομαι', 'ἁλώσομαι', 'ἑάλων/ἥλων', 'ἑάλωκα/ἥλωκα', '', ''],
    ['ἀλλάττω', 'ἀλλάξω', 'ἤλλαξα', 'ἤλλαχα', 'ἤλλαγμαι', 'ἠλλάχθην/ἠλλάγην'],
    ['ἁμαρτάνω', 'ἁμαρτήσομαι', 'ἥμαρτον', 'ἡμάρτηκα', 'ἡμάρτημαι', 'ἡμαρτήθην'],
    ['ἀξιόω', 'ἀξιώσω', 'ἠξίωσα', 'ἠξίωκα', 'ἠξίωμαι', 'ἠξιώθην'],
    ['ἀπαντάω', 'ἀπαντήσομαι', 'ἀπήντησα', 'ἀπήντηκα', '', ''],
    ['ἀποθνῄσκω', 'ἀποθανέομαι', 'ἀπέθανον', 'τέθνηκα', '', ''],
    ['ἀποκτείνω', 'ἀποκτενέω', 'ἀπέκτεινα', 'ἀπέκτονα', '', ''],
    ['ἀπόλλυμι', 'ἀπολέω', 'ἀπώλεσα/ἀπωλόμην', 'ἀπολώλεκα/ἀπόλωλα', '', ''],
    ['ἀπολογέομαι', 'ἀπολογήσομαι', 'ἀπελογησάμην', '', 'ἀπολελόγημαι', ''],
    ['ἀπορέω', 'ἀπορήσω', 'ἠπόρησα', 'ἠπόρηκα', 'ἠπόρημαι', 'ἠπορήθην'],
    ['ἁρπάζω', 'ἁρπάσομαι', 'ἥρπασα', 'ἥρπακα', 'ἥρπασμαι', 'ἡρπάσθην'],
    ['ἄρχω', 'ἄρξω', 'ἦρξα', 'ἦρχα', 'ἦργμαι', 'ἤρχθην'],
    ['ἀσεβέω', 'ἀσεβήσω', 'ἠσέβησα', 'ἠσέβηκα', 'ἠσέβημαι', 'ἠσεβήθην'],
    ['ἀσθενέω', 'ἀσθενήσω', 'ἠσθένησα', 'ἠσθένηκα', '', ''],
    ['ἀτιμάζω', 'ἀτιμάσω', 'ἠτίμασα', 'ἠτίμακα', 'ἠτίμασμαι', 'ἠτιμάσθην'],
    ['ἀφικνέομαι', 'ἀφίξομαι', 'ἀφικόμην', '', 'ἀφῖγμαι', ''],
    ['βαίνω', '-βήσομαι', '-ἔβην', 'βέβηκα', '-βέβαμαι', '-εβάθην'],
    ['βάλλω', 'βαλέω', 'ἔβαλον', 'βέβληκα', 'βέβλημαι', 'ἐβλήθην'],
    ['βασιλεύω', 'βασιλεύσω', 'ἐβασίλευσα', '', '', ''],
    ['βλάπτω', 'βλάψω', 'ἔβλαψα', 'βέβλαφα', 'βέβλαμμαι', 'ἐβλάβην/ἐβλάφθην'],
    ['βοηθέω', 'βοηθήσω', 'ἐβοήθησα', 'βεβοήθηκα', 'βεβοήθημαι', ''],
    ['βουλεύω', 'βουλεύσω', 'ἐβούλευσα', 'βεβούλευκα', 'βεβούλευμαι', 'ἐβουλεύθην'],
    ['βούλομαι', 'βουλήσομαι', '', '', 'βεβούλημαι', 'ἐβουλήθην'],
    ['γαμέω', 'γαμέω', 'ἔγημα', 'γεγάμηκα', 'γεγάμημαι', ''],
    ['γελάω', 'γελάσομαι', 'ἐγέλασα', '', '', 'ἐγελάσθην'],
    ['γίγνομαι', 'γενήσομαι', 'ἐγενόμην', 'γέγονα', 'γεγένημαι', 'ἐγενήθην'],
    ['γιγνώσκω', 'γνώσομαι', 'ἔγνων', 'ἔγνωκα', 'ἔγνωσμαι', 'ἐγνώσθην'],
    ['γράφω', 'γράψω', 'ἔγραψα', 'γέγραφα', 'γέγραμμαι', 'ἐγράφην'],
    ['γυμνάζω', 'γυμνάσω', 'ἐγύμνασα', 'γεγύμνακα', 'γεγύμνασμαι', 'ἐγυμνάσθην'],
    ['δαπανάω', 'δαπανήσω', 'ἐδαπάνησα', 'δεδαπάνηκα', 'δεδαπάνημαι', 'ἐδανανήθην'],
    ['δέδοικα', '(δείσομαι)', 'ἔδεισα', '', '', ''],
    ['δέδια', '(δείσομαι)', 'ἔδεισα', '', '', ''],
    ['δείκνυμι', 'δείξω', 'ἔδειξα', 'δέδειχα', 'δέδειγμαι', 'ἐδείχθην'],
    ['δέω', 'δεήσω', 'ἐδέησα', 'δεδέηκα', 'δεδέημαι', 'ἐδεήθην'],
    ['δέομαι', 'δεήσομαι', '', '', '', 'ἐδεήθην'],
    ['δεῖ', 'δεήσει', 'ἐδέησε', '', '', ''],
    ['δηλόω', 'δηλώσω', 'ἐδήλωσα', 'δεδήλωκα', 'δεδήλωμαι', 'ἐδηλώθην'],
    ['διαλέγομαι', 'διαλέξομαι', '', '', 'διείλεγμαι', 'διελέχθην/διελέγην'],
    ['διασκεδάννυμι', 'διασκεδάω', 'διεσκέδασα', '', 'διεσκέδασμαι', 'διεσκεδάσθην'],
    ['διαφθείρω', 'διαφθερέω', 'διέφθειρα', 'διέφθαρκα/διέφθορα', 'διέφθαρμαι', 'διεφθάρην'],
    ['διδάσκω', 'διδάξω', 'ἐδίδαξα', 'δεδίδαχα', 'δεδίδαγμαι', 'ἐδιδάχθην'],
    ['δίδωμι', 'δώσω', 'ἔδωκα', 'δέδωκα', 'δέδομαι', 'ἐδόθην'],
    ['δικάζω', 'δικάσω', 'ἐδίκασα', 'δεδίκακα', 'δεδίκασμαι', 'ἐδικάσθην'],
    ['διώκω', 'διώξομαι/διώξω', 'ἐδίωξα', 'δεδίωχα', '', 'ἐδιώχθην'],
    ['δοκέω', 'δόξω', 'ἔδοξα', '', 'δέδογμαι', '-εδόχθην'],
    ['δοκεῖ', 'δόξει', 'ἔδοξε', '', 'δέδοκται', ''],
    ['δουλεύω', 'δουλεύσω', 'ἐδούλευσα', 'δεδούλευκα', '', ''],
    ['δύναμαι', 'δυνήσομαι', '', '', 'δεδύνημαι', 'ἐδυνήθην'],
    ['δύω', '-δύσω', '-ἔδυσα/ἔδυν', '-δέδυκα', '-δέδυμαι', '-ἐδύθην'],
    ['δύνω', '-δύσω', '-ἔδυσα/ἔδυν', '-δέδυκα', '-δέδυμαι', '-ἐδύθην'],
    ['ἐάω', 'ἐάσω', 'εἴασα', 'εἴακα', 'εἴαμαι', 'εἰάθην'],
    ['ἐθέλω', 'ἐθελήσω', 'ἠθέλησα', 'ἠθέληκα', '', ''],
    ['εἰμί', 'ἔσομαι', '', '', '', ''],
    ['εἶμι', 'εἶμι/ἐλεύσομαι', 'ἦλθον', 'ἐλήλυθα', '', ''],
    ['ἔρχομαι', 'ἐλεύσομαι/εἶμι', 'ἦλθον', 'ἐλήλυθα', '', ''],
    ['εἴρομαι', 'ἐρήσομαι', 'ἠρόμην', '', '', ''],
    ['ἐλαύνω', 'ἐλάω', 'ἤλασα', '-ελήλακα', 'ἐλήλαμαι', 'ἠλάθην'],
    ['ἐλέγχω', 'ἐλέγξω', 'ἤλεγξα', '', 'ἐλήλεγμαι', 'ἠλέγχθην'],
    ['ἐλπίζω', 'ἐλπιέω', 'ἤλπισα', '', '', 'ἠλπίσθην'],
    ['ἐμπίμπλημι', 'ἐμπλήσω', 'ἐνέπλησα', 'ἐμπέπληκα', 'ἐμπέπλησμαι', 'ἐνεπλήσθην'],
    ['ἐξαπατάω', 'ἐξαπατήσω', 'ἐξηπάτησα', 'ἐξηπάτηκα', 'ἐξηπάτημαι', 'ἐξηπατήθην'],
    ['ἔοικα', 'εἴξω', '', '', '', ''],
    ['ἐπαινέω', 'ἐπαινέσομαι/ἐπαινέσω', 'ἐπῄνεσα', 'ἐπῄνεκα', 'ἐπῄνημαι', 'ἐπῃνέθην'],
    # ['', '', '', '', '', ''],
    ['λύω', 'λύσω', 'ἔλυσα', 'λέλυκα', 'λέλυμαι', 'ἐλύθην'],
]

# get list of unaccented first principal parts
stripped_1st_pps = []
for x in verbs:
    pp1_stripped = ''
    for letter in x[0]:
        pp1_stripped += base(letter)
    stripped_1st_pps.append(pp1_stripped)

request = input("For what verb would you like the principal parts?: ")

def strip_accents(word):
    '''
    remove breathings and accents from greek characters
    input: string (greek word with accents)
    output: string (greek word without accents)
    '''

    new_string = ''
    for letter in word:
        new_string += base(letter)
    return new_string

def get_stripped_1st_pp(requested_verb):
    '''
    if latin input, transliterate to greek characters; if greek characters,
    strip the greek characters of breathings and accents
    input: string (either in latin or greek alphabet)
    output: string (in greek alphabet, no accents)
    '''

    if re.search('[a-z]', requested_verb):
        new_string = ''
        for letter in request:
            new_string += character_map[str(letter)]
    else:
        new_string = strip_accents(requested_verb)

    return new_string

if get_stripped_1st_pp(request) not in stripped_1st_pps:
    print('verb not found!')
else:
    for x in verbs:
        if request == x[0] or get_stripped_1st_pp(request) == strip_accents(x[0]):
            print(x)
        else:
            pass
